Revit 2026 API

# StructuralSectionUtils Methods

---

The StructuralSectionUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetStructuralElementDefinitionData | Return structural element definition data. |
|  | GetStructuralSection | Return structural section from element. |
|  | SetStructuralSection | Set structural section in element. |

#### Reference

StructuralSectionUtils Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace